{"backend": "tensorflow", "keras_version": "2.4.0", "config": {"layers": [{"config": {"dtype": "float32", "name": "lstm_411_input", "ragged": false, "sparse": false, "batch_input_shape": [null, 28, 28]}, "class_name": "InputLayer"}, {"config": {"recurrent_activation": "sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_411", "go_backwards": false, "kernel_constraint": null, "stateful": false, "unroll": false, "implementation": 2, "recurrent_dropout": 0.0, "activity_regularizer": null, "trainable": true, "unit_forget_bias": true, "dropout": 0.0, "kernel_regularizer": null, "return_state": false, "return_sequences": true, "use_bias": true, "batch_input_shape": [null, 28, 28], "units": 128, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "recurrent_constraint": null, "time_major": false, "dtype": "float32", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "name": "dropout_411", "dtype": "float32", "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"recurrent_activation": "sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_412", "go_backwards": false, "kernel_constraint": null, "stateful": false, "implementation": 2, "recurrent_dropout": 0.0, "activity_regularizer": null, "trainable": true, "unit_forget_bias": true, "dropout": 0.0, "kernel_regularizer": null, "return_state": false, "return_sequences": false, "use_bias": true, "unroll": false, "units": 128, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "recurrent_constraint": null, "time_major": false, "dtype": "float32", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "name": "dropout_412", "dtype": "float32", "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "name": "dense_93", "use_bias": true, "activation": "linear", "units": 1, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Dense"}], "name": "sequential_93"}, "class_name": "Sequential"}