{"keras_version": "2.4.0", "config": {"input_layers": [["input_8", 0, 0]], "name": "functional_15", "output_layers": [["dense_7", 0, 0]], "layers": [{"name": "input_8", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 784, 1], "name": "input_8", "ragged": false, "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "conv1d_45", "class_name": "Conv1D", "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "strides": [1], "activation": "linear", "dtype": "float32", "kernel_regularizer": null, "name": "conv1d_45", "kernel_constraint": null, "dilation_rate": [1], "padding": "causal", "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3], "filters": 64, "trainable": true}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "batch_normalization_38", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "dtype": "float32", "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [2], "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_38", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}, "inbound_nodes": [[["conv1d_45", 0, 0, {}]]]}, {"name": "activation_57", "class_name": "Activation", "config": {"name": "activation_57", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_38", 0, 0, {}]]]}, {"name": "dropout_38", "class_name": "Dropout", "config": {"seed": null, "rate": 0.2, "dtype": "float32", "name": "dropout_38", "noise_shape": null, "trainable": true}, "inbound_nodes": [[["activation_57", 0, 0, {}]]]}, {"name": "conv1d_46", "class_name": "Conv1D", "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "strides": [1], "activation": "linear", "dtype": "float32", "kernel_regularizer": null, "name": "conv1d_46", "kernel_constraint": null, "dilation_rate": [1], "padding": "causal", "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3], "filters": 64, "trainable": true}, "inbound_nodes": [[["dropout_38", 0, 0, {}]]]}, {"name": "batch_normalization_39", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "dtype": "float32", "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [2], "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_39", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}, "inbound_nodes": [[["conv1d_46", 0, 0, {}]]]}, {"name": "activation_58", "class_name": "Activation", "config": {"name": "activation_58", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_39", 0, 0, {}]]]}, {"name": "conv1d_47", "class_name": "Conv1D", "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "strides": [1], "activation": "linear", "dtype": "float32", "kernel_regularizer": null, "name": "conv1d_47", "kernel_constraint": null, "dilation_rate": [1], "padding": "same", "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [1], "filters": 64, "trainable": true}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "dropout_39", "class_name": "Dropout", "config": {"seed": null, "rate": 0.2, "dtype": "float32", "name": "dropout_39", "noise_shape": null, "trainable": true}, "inbound_nodes": [[["activation_58", 0, 0, {}]]]}, {"name": "tf_op_layer_AddV2_19", "class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_19", "node_def": {"name": "AddV2_19", "input": ["conv1d_47/BiasAdd", "dropout_39/cond/Identity"], "op": "AddV2", "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}, "dtype": "float32", "trainable": true}, "inbound_nodes": [[["conv1d_47", 0, 0, {}], ["dropout_39", 0, 0, {}]]]}, {"name": "activation_59", "class_name": "Activation", "config": {"name": "activation_59", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["tf_op_layer_AddV2_19", 0, 0, {}]]]}, {"name": "conv1d_48", "class_name": "Conv1D", "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "strides": [1], "activation": "linear", "dtype": "float32", "kernel_regularizer": null, "name": "conv1d_48", "kernel_constraint": null, "dilation_rate": [2], "padding": "causal", "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3], "filters": 64, "trainable": true}, "inbound_nodes": [[["activation_59", 0, 0, {}]]]}, {"name": "batch_normalization_40", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "dtype": "float32", "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [2], "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_40", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}, "inbound_nodes": [[["conv1d_48", 0, 0, {}]]]}, {"name": "activation_60", "class_name": "Activation", "config": {"name": "activation_60", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_40", 0, 0, {}]]]}, {"name": "dropout_40", "class_name": "Dropout", "config": {"seed": null, "rate": 0.2, "dtype": "float32", "name": "dropout_40", "noise_shape": null, "trainable": true}, "inbound_nodes": [[["activation_60", 0, 0, {}]]]}, {"name": "conv1d_49", "class_name": "Conv1D", "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "strides": [1], "activation": "linear", "dtype": "float32", "kernel_regularizer": null, "name": "conv1d_49", "kernel_constraint": null, "dilation_rate": [2], "padding": "causal", "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3], "filters": 64, "trainable": true}, "inbound_nodes": [[["dropout_40", 0, 0, {}]]]}, {"name": "batch_normalization_41", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "dtype": "float32", "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [2], "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_41", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}, "inbound_nodes": [[["conv1d_49", 0, 0, {}]]]}, {"name": "activation_61", "class_name": "Activation", "config": {"name": "activation_61", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_41", 0, 0, {}]]]}, {"name": "dropout_41", "class_name": "Dropout", "config": {"seed": null, "rate": 0.2, "dtype": "float32", "name": "dropout_41", "noise_shape": null, "trainable": true}, "inbound_nodes": [[["activation_61", 0, 0, {}]]]}, {"name": "tf_op_layer_AddV2_20", "class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_20", "node_def": {"name": "AddV2_20", "input": ["activation_59/Relu", "dropout_41/cond/Identity"], "op": "AddV2", "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}, "dtype": "float32", "trainable": true}, "inbound_nodes": [[["activation_59", 0, 0, {}], ["dropout_41", 0, 0, {}]]]}, {"name": "activation_62", "class_name": "Activation", "config": {"name": "activation_62", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["tf_op_layer_AddV2_20", 0, 0, {}]]]}, {"name": "conv1d_50", "class_name": "Conv1D", "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "strides": [1], "activation": "linear", "dtype": "float32", "kernel_regularizer": null, "name": "conv1d_50", "kernel_constraint": null, "dilation_rate": [4], "padding": "causal", "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3], "filters": 64, "trainable": true}, "inbound_nodes": [[["activation_62", 0, 0, {}]]]}, {"name": "batch_normalization_42", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "dtype": "float32", "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [2], "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_42", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}, "inbound_nodes": [[["conv1d_50", 0, 0, {}]]]}, {"name": "activation_63", "class_name": "Activation", "config": {"name": "activation_63", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_42", 0, 0, {}]]]}, {"name": "dropout_42", "class_name": "Dropout", "config": {"seed": null, "rate": 0.2, "dtype": "float32", "name": "dropout_42", "noise_shape": null, "trainable": true}, "inbound_nodes": [[["activation_63", 0, 0, {}]]]}, {"name": "conv1d_51", "class_name": "Conv1D", "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "strides": [1], "activation": "linear", "dtype": "float32", "kernel_regularizer": null, "name": "conv1d_51", "kernel_constraint": null, "dilation_rate": [4], "padding": "causal", "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3], "filters": 64, "trainable": true}, "inbound_nodes": [[["dropout_42", 0, 0, {}]]]}, {"name": "batch_normalization_43", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "dtype": "float32", "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [2], "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_43", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}, "inbound_nodes": [[["conv1d_51", 0, 0, {}]]]}, {"name": "activation_64", "class_name": "Activation", "config": {"name": "activation_64", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_43", 0, 0, {}]]]}, {"name": "dropout_43", "class_name": "Dropout", "config": {"seed": null, "rate": 0.2, "dtype": "float32", "name": "dropout_43", "noise_shape": null, "trainable": true}, "inbound_nodes": [[["activation_64", 0, 0, {}]]]}, {"name": "tf_op_layer_AddV2_21", "class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_21", "node_def": {"name": "AddV2_21", "input": ["activation_62/Relu", "dropout_43/cond/Identity"], "op": "AddV2", "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}, "dtype": "float32", "trainable": true}, "inbound_nodes": [[["activation_62", 0, 0, {}], ["dropout_43", 0, 0, {}]]]}, {"name": "activation_65", "class_name": "Activation", "config": {"name": "activation_65", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["tf_op_layer_AddV2_21", 0, 0, {}]]]}, {"name": "conv1d_52", "class_name": "Conv1D", "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "strides": [1], "activation": "linear", "dtype": "float32", "kernel_regularizer": null, "name": "conv1d_52", "kernel_constraint": null, "dilation_rate": [8], "padding": "causal", "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3], "filters": 64, "trainable": true}, "inbound_nodes": [[["activation_65", 0, 0, {}]]]}, {"name": "batch_normalization_44", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "dtype": "float32", "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [2], "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_44", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}, "inbound_nodes": [[["conv1d_52", 0, 0, {}]]]}, {"name": "activation_66", "class_name": "Activation", "config": {"name": "activation_66", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_44", 0, 0, {}]]]}, {"name": "dropout_44", "class_name": "Dropout", "config": {"seed": null, "rate": 0.2, "dtype": "float32", "name": "dropout_44", "noise_shape": null, "trainable": true}, "inbound_nodes": [[["activation_66", 0, 0, {}]]]}, {"name": "conv1d_53", "class_name": "Conv1D", "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "strides": [1], "activation": "linear", "dtype": "float32", "kernel_regularizer": null, "name": "conv1d_53", "kernel_constraint": null, "dilation_rate": [8], "padding": "causal", "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3], "filters": 64, "trainable": true}, "inbound_nodes": [[["dropout_44", 0, 0, {}]]]}, {"name": "batch_normalization_45", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "dtype": "float32", "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [2], "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_45", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}, "inbound_nodes": [[["conv1d_53", 0, 0, {}]]]}, {"name": "activation_67", "class_name": "Activation", "config": {"name": "activation_67", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_45", 0, 0, {}]]]}, {"name": "dropout_45", "class_name": "Dropout", "config": {"seed": null, "rate": 0.2, "dtype": "float32", "name": "dropout_45", "noise_shape": null, "trainable": true}, "inbound_nodes": [[["activation_67", 0, 0, {}]]]}, {"name": "tf_op_layer_AddV2_22", "class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_22", "node_def": {"name": "AddV2_22", "input": ["activation_65/Relu", "dropout_45/cond/Identity"], "op": "AddV2", "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}, "dtype": "float32", "trainable": true}, "inbound_nodes": [[["activation_65", 0, 0, {}], ["dropout_45", 0, 0, {}]]]}, {"name": "activation_68", "class_name": "Activation", "config": {"name": "activation_68", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["tf_op_layer_AddV2_22", 0, 0, {}]]]}, {"name": "tf_op_layer_strided_slice_7", "class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_7", "node_def": {"name": "strided_slice_7", "input": ["activation_68/Relu", "strided_slice_7/begin", "strided_slice_7/end", "strided_slice_7/strides"], "op": "StridedSlice", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "end_mask": {"i": "5"}}}, "constants": {"1": [0, -1, 0], "2": [0, 0, 0], "3": [1, 1, 1]}, "dtype": "float32", "trainable": true}, "inbound_nodes": [[["activation_68", 0, 0, {}]]]}, {"name": "dense_7", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "activity_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "name": "dense_7", "kernel_constraint": null, "activation": "linear", "units": 1, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true}, "inbound_nodes": [[["tf_op_layer_strided_slice_7", 0, 0, {}]]]}]}, "class_name": "Functional", "backend": "tensorflow"}