{"class_name": "Functional", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "ragged": false, "batch_input_shape": [null, 784, 1], "dtype": "float32", "name": "input_11"}, "name": "input_11"}, {"class_name": "Conv1D", "inbound_nodes": [[["input_11", 0, 0, {}]]], "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "padding": "causal", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 64, "dtype": "float32", "trainable": true, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "kernel_size": [3], "bias_constraint": null, "name": "conv1d_74", "activation": "linear", "kernel_regularizer": null}, "name": "conv1d_74"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_74", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [2], "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "dtype": "float32", "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_64", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "scale": true}, "name": "batch_normalization_64"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_64", 0, 0, {}]]], "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_96"}, "name": "activation_96"}, {"class_name": "Dropout", "inbound_nodes": [[["activation_96", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_64", "seed": null, "dtype": "float32", "trainable": true}, "name": "dropout_64"}, {"class_name": "Conv1D", "inbound_nodes": [[["dropout_64", 0, 0, {}]]], "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "padding": "causal", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 64, "dtype": "float32", "trainable": true, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "kernel_size": [3], "bias_constraint": null, "name": "conv1d_75", "activation": "linear", "kernel_regularizer": null}, "name": "conv1d_75"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_75", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [2], "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "dtype": "float32", "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_65", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "scale": true}, "name": "batch_normalization_65"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_65", 0, 0, {}]]], "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_97"}, "name": "activation_97"}, {"class_name": "Conv1D", "inbound_nodes": [[["input_11", 0, 0, {}]]], "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "padding": "same", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 64, "dtype": "float32", "trainable": true, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "kernel_size": [1], "bias_constraint": null, "name": "conv1d_76", "activation": "linear", "kernel_regularizer": null}, "name": "conv1d_76"}, {"class_name": "Dropout", "inbound_nodes": [[["activation_97", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_65", "seed": null, "dtype": "float32", "trainable": true}, "name": "dropout_65"}, {"class_name": "TensorFlowOpLayer", "inbound_nodes": [[["conv1d_76", 0, 0, {}], ["dropout_65", 0, 0, {}]]], "config": {"node_def": {"input": ["conv1d_76/BiasAdd", "dropout_65/cond/Identity"], "name": "AddV2_32", "op": "AddV2", "attr": {"T": {"type": "DT_FLOAT"}}}, "dtype": "float32", "trainable": true, "name": "AddV2_32", "constants": {}}, "name": "tf_op_layer_AddV2_32"}, {"class_name": "Activation", "inbound_nodes": [[["tf_op_layer_AddV2_32", 0, 0, {}]]], "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_98"}, "name": "activation_98"}, {"class_name": "Conv1D", "inbound_nodes": [[["activation_98", 0, 0, {}]]], "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "padding": "causal", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 64, "dtype": "float32", "trainable": true, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [2], "kernel_size": [3], "bias_constraint": null, "name": "conv1d_77", "activation": "linear", "kernel_regularizer": null}, "name": "conv1d_77"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_77", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [2], "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "dtype": "float32", "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_66", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "scale": true}, "name": "batch_normalization_66"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_66", 0, 0, {}]]], "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_99"}, "name": "activation_99"}, {"class_name": "Dropout", "inbound_nodes": [[["activation_99", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_66", "seed": null, "dtype": "float32", "trainable": true}, "name": "dropout_66"}, {"class_name": "Conv1D", "inbound_nodes": [[["dropout_66", 0, 0, {}]]], "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "padding": "causal", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 64, "dtype": "float32", "trainable": true, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [2], "kernel_size": [3], "bias_constraint": null, "name": "conv1d_78", "activation": "linear", "kernel_regularizer": null}, "name": "conv1d_78"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_78", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [2], "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "dtype": "float32", "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_67", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "scale": true}, "name": "batch_normalization_67"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_67", 0, 0, {}]]], "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_100"}, "name": "activation_100"}, {"class_name": "Dropout", "inbound_nodes": [[["activation_100", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_67", "seed": null, "dtype": "float32", "trainable": true}, "name": "dropout_67"}, {"class_name": "TensorFlowOpLayer", "inbound_nodes": [[["activation_98", 0, 0, {}], ["dropout_67", 0, 0, {}]]], "config": {"node_def": {"input": ["activation_98/Relu", "dropout_67/cond/Identity"], "name": "AddV2_33", "op": "AddV2", "attr": {"T": {"type": "DT_FLOAT"}}}, "dtype": "float32", "trainable": true, "name": "AddV2_33", "constants": {}}, "name": "tf_op_layer_AddV2_33"}, {"class_name": "Activation", "inbound_nodes": [[["tf_op_layer_AddV2_33", 0, 0, {}]]], "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_101"}, "name": "activation_101"}, {"class_name": "Conv1D", "inbound_nodes": [[["activation_101", 0, 0, {}]]], "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "padding": "causal", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 64, "dtype": "float32", "trainable": true, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [4], "kernel_size": [3], "bias_constraint": null, "name": "conv1d_79", "activation": "linear", "kernel_regularizer": null}, "name": "conv1d_79"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_79", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [2], "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "dtype": "float32", "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_68", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "scale": true}, "name": "batch_normalization_68"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_68", 0, 0, {}]]], "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_102"}, "name": "activation_102"}, {"class_name": "Dropout", "inbound_nodes": [[["activation_102", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_68", "seed": null, "dtype": "float32", "trainable": true}, "name": "dropout_68"}, {"class_name": "Conv1D", "inbound_nodes": [[["dropout_68", 0, 0, {}]]], "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "padding": "causal", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 64, "dtype": "float32", "trainable": true, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [4], "kernel_size": [3], "bias_constraint": null, "name": "conv1d_80", "activation": "linear", "kernel_regularizer": null}, "name": "conv1d_80"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_80", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [2], "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "dtype": "float32", "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_69", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "scale": true}, "name": "batch_normalization_69"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_69", 0, 0, {}]]], "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_103"}, "name": "activation_103"}, {"class_name": "Dropout", "inbound_nodes": [[["activation_103", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_69", "seed": null, "dtype": "float32", "trainable": true}, "name": "dropout_69"}, {"class_name": "TensorFlowOpLayer", "inbound_nodes": [[["activation_101", 0, 0, {}], ["dropout_69", 0, 0, {}]]], "config": {"node_def": {"input": ["activation_101/Relu", "dropout_69/cond/Identity"], "name": "AddV2_34", "op": "AddV2", "attr": {"T": {"type": "DT_FLOAT"}}}, "dtype": "float32", "trainable": true, "name": "AddV2_34", "constants": {}}, "name": "tf_op_layer_AddV2_34"}, {"class_name": "Activation", "inbound_nodes": [[["tf_op_layer_AddV2_34", 0, 0, {}]]], "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_104"}, "name": "activation_104"}, {"class_name": "Conv1D", "inbound_nodes": [[["activation_104", 0, 0, {}]]], "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "padding": "causal", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 64, "dtype": "float32", "trainable": true, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [8], "kernel_size": [3], "bias_constraint": null, "name": "conv1d_81", "activation": "linear", "kernel_regularizer": null}, "name": "conv1d_81"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_81", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [2], "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "dtype": "float32", "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_70", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "scale": true}, "name": "batch_normalization_70"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_70", 0, 0, {}]]], "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_105"}, "name": "activation_105"}, {"class_name": "Dropout", "inbound_nodes": [[["activation_105", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_70", "seed": null, "dtype": "float32", "trainable": true}, "name": "dropout_70"}, {"class_name": "Conv1D", "inbound_nodes": [[["dropout_70", 0, 0, {}]]], "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "padding": "causal", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 64, "dtype": "float32", "trainable": true, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [8], "kernel_size": [3], "bias_constraint": null, "name": "conv1d_82", "activation": "linear", "kernel_regularizer": null}, "name": "conv1d_82"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_82", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [2], "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "dtype": "float32", "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_71", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "scale": true}, "name": "batch_normalization_71"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_71", 0, 0, {}]]], "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_106"}, "name": "activation_106"}, {"class_name": "Dropout", "inbound_nodes": [[["activation_106", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_71", "seed": null, "dtype": "float32", "trainable": true}, "name": "dropout_71"}, {"class_name": "TensorFlowOpLayer", "inbound_nodes": [[["activation_104", 0, 0, {}], ["dropout_71", 0, 0, {}]]], "config": {"node_def": {"input": ["activation_104/Relu", "dropout_71/cond/Identity"], "name": "AddV2_35", "op": "AddV2", "attr": {"T": {"type": "DT_FLOAT"}}}, "dtype": "float32", "trainable": true, "name": "AddV2_35", "constants": {}}, "name": "tf_op_layer_AddV2_35"}, {"class_name": "Activation", "inbound_nodes": [[["tf_op_layer_AddV2_35", 0, 0, {}]]], "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_107"}, "name": "activation_107"}, {"class_name": "Conv1D", "inbound_nodes": [[["activation_107", 0, 0, {}]]], "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "padding": "causal", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 64, "dtype": "float32", "trainable": true, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [16], "kernel_size": [3], "bias_constraint": null, "name": "conv1d_83", "activation": "linear", "kernel_regularizer": null}, "name": "conv1d_83"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_83", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [2], "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "dtype": "float32", "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_72", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "scale": true}, "name": "batch_normalization_72"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_72", 0, 0, {}]]], "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_108"}, "name": "activation_108"}, {"class_name": "Dropout", "inbound_nodes": [[["activation_108", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_72", "seed": null, "dtype": "float32", "trainable": true}, "name": "dropout_72"}, {"class_name": "Conv1D", "inbound_nodes": [[["dropout_72", 0, 0, {}]]], "config": {"groups": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "padding": "causal", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 64, "dtype": "float32", "trainable": true, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [16], "kernel_size": [3], "bias_constraint": null, "name": "conv1d_84", "activation": "linear", "kernel_regularizer": null}, "name": "conv1d_84"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_84", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [2], "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "dtype": "float32", "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_73", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "scale": true}, "name": "batch_normalization_73"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_73", 0, 0, {}]]], "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_109"}, "name": "activation_109"}, {"class_name": "Dropout", "inbound_nodes": [[["activation_109", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_73", "seed": null, "dtype": "float32", "trainable": true}, "name": "dropout_73"}, {"class_name": "TensorFlowOpLayer", "inbound_nodes": [[["activation_107", 0, 0, {}], ["dropout_73", 0, 0, {}]]], "config": {"node_def": {"input": ["activation_107/Relu", "dropout_73/cond/Identity"], "name": "AddV2_36", "op": "AddV2", "attr": {"T": {"type": "DT_FLOAT"}}}, "dtype": "float32", "trainable": true, "name": "AddV2_36", "constants": {}}, "name": "tf_op_layer_AddV2_36"}, {"class_name": "Activation", "inbound_nodes": [[["tf_op_layer_AddV2_36", 0, 0, {}]]], "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_110"}, "name": "activation_110"}, {"class_name": "TensorFlowOpLayer", "inbound_nodes": [[["activation_110", 0, 0, {}]]], "config": {"node_def": {"input": ["activation_110/Relu", "strided_slice_10/begin", "strided_slice_10/end", "strided_slice_10/strides"], "name": "strided_slice_10", "op": "StridedSlice", "attr": {"T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "end_mask": {"i": "5"}, "Index": {"type": "DT_INT32"}}}, "dtype": "float32", "trainable": true, "name": "strided_slice_10", "constants": {"1": [0, -1, 0], "2": [0, 0, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_strided_slice_10"}, {"class_name": "Dense", "inbound_nodes": [[["tf_op_layer_strided_slice_10", 0, 0, {}]]], "config": {"units": 28, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 42, "stddev": 0.01, "mean": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_10", "activation": "linear", "kernel_regularizer": null}, "name": "dense_10"}], "input_layers": [["input_11", 0, 0]], "output_layers": [["dense_10", 0, 0]], "name": "functional_21"}, "keras_version": "2.4.0", "backend": "tensorflow"}