{"class_name": "Functional", "config": {"name": "functional_15", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 784, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_8"}, "name": "input_8", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "conv1d_105", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_105", "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_98", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_98", "inbound_nodes": [[["conv1d_105", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_147", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_147", "inbound_nodes": [[["batch_normalization_98", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_98", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_98", "inbound_nodes": [[["activation_147", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_106", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_106", "inbound_nodes": [[["dropout_98", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_99", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_99", "inbound_nodes": [[["conv1d_106", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_148", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_148", "inbound_nodes": [[["batch_normalization_99", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_107", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_107", "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_99", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_99", "inbound_nodes": [[["activation_148", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_49", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_49", "op": "AddV2", "input": ["conv1d_107/BiasAdd", "dropout_99/cond/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_49", "inbound_nodes": [[["conv1d_107", 0, 0, {}], ["dropout_99", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_149", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_149", "inbound_nodes": [[["tf_op_layer_AddV2_49", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_108", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [2], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_108", "inbound_nodes": [[["activation_149", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_100", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_100", "inbound_nodes": [[["conv1d_108", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_150", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_150", "inbound_nodes": [[["batch_normalization_100", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_100", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_100", "inbound_nodes": [[["activation_150", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_109", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [2], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_109", "inbound_nodes": [[["dropout_100", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_101", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_101", "inbound_nodes": [[["conv1d_109", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_151", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_151", "inbound_nodes": [[["batch_normalization_101", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_101", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_101", "inbound_nodes": [[["activation_151", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_50", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_50", "op": "AddV2", "input": ["activation_149/Relu", "dropout_101/cond/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_50", "inbound_nodes": [[["activation_149", 0, 0, {}], ["dropout_101", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_152", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_152", "inbound_nodes": [[["tf_op_layer_AddV2_50", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_110", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [4], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_110", "inbound_nodes": [[["activation_152", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_102", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_102", "inbound_nodes": [[["conv1d_110", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_153", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_153", "inbound_nodes": [[["batch_normalization_102", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_102", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_102", "inbound_nodes": [[["activation_153", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_111", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [4], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_111", "inbound_nodes": [[["dropout_102", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_103", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_103", "inbound_nodes": [[["conv1d_111", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_154", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_154", "inbound_nodes": [[["batch_normalization_103", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_103", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_103", "inbound_nodes": [[["activation_154", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_51", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_51", "op": "AddV2", "input": ["activation_152/Relu", "dropout_103/cond/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_51", "inbound_nodes": [[["activation_152", 0, 0, {}], ["dropout_103", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_155", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_155", "inbound_nodes": [[["tf_op_layer_AddV2_51", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_112", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [8], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_112", "inbound_nodes": [[["activation_155", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_104", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_104", "inbound_nodes": [[["conv1d_112", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_156", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_156", "inbound_nodes": [[["batch_normalization_104", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_104", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_104", "inbound_nodes": [[["activation_156", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_113", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [8], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_113", "inbound_nodes": [[["dropout_104", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_105", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_105", "inbound_nodes": [[["conv1d_113", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_157", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_157", "inbound_nodes": [[["batch_normalization_105", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_105", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_105", "inbound_nodes": [[["activation_157", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_52", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_52", "op": "AddV2", "input": ["activation_155/Relu", "dropout_105/cond/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_52", "inbound_nodes": [[["activation_155", 0, 0, {}], ["dropout_105", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_158", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_158", "inbound_nodes": [[["tf_op_layer_AddV2_52", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_114", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [16], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_114", "inbound_nodes": [[["activation_158", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_106", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_106", "inbound_nodes": [[["conv1d_114", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_159", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_159", "inbound_nodes": [[["batch_normalization_106", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_106", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_106", "inbound_nodes": [[["activation_159", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_115", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [16], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_115", "inbound_nodes": [[["dropout_106", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_107", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_107", "inbound_nodes": [[["conv1d_115", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_160", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_160", "inbound_nodes": [[["batch_normalization_107", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_107", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_107", "inbound_nodes": [[["activation_160", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_53", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_53", "op": "AddV2", "input": ["activation_158/Relu", "dropout_107/cond/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_53", "inbound_nodes": [[["activation_158", 0, 0, {}], ["dropout_107", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_161", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_161", "inbound_nodes": [[["tf_op_layer_AddV2_53", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_116", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [32], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_116", "inbound_nodes": [[["activation_161", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_108", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_108", "inbound_nodes": [[["conv1d_116", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_162", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_162", "inbound_nodes": [[["batch_normalization_108", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_108", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_108", "inbound_nodes": [[["activation_162", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_117", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [32], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_117", "inbound_nodes": [[["dropout_108", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_109", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_109", "inbound_nodes": [[["conv1d_117", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_163", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_163", "inbound_nodes": [[["batch_normalization_109", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_109", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_109", "inbound_nodes": [[["activation_163", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_54", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_54", "op": "AddV2", "input": ["activation_161/Relu", "dropout_109/cond/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_54", "inbound_nodes": [[["activation_161", 0, 0, {}], ["dropout_109", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_164", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_164", "inbound_nodes": [[["tf_op_layer_AddV2_54", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_118", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [64], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_118", "inbound_nodes": [[["activation_164", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_110", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_110", "inbound_nodes": [[["conv1d_118", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_165", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_165", "inbound_nodes": [[["batch_normalization_110", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_110", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_110", "inbound_nodes": [[["activation_165", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_119", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [64], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_119", "inbound_nodes": [[["dropout_110", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_111", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_111", "inbound_nodes": [[["conv1d_119", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_166", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_166", "inbound_nodes": [[["batch_normalization_111", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_111", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_111", "inbound_nodes": [[["activation_166", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_55", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_55", "op": "AddV2", "input": ["activation_164/Relu", "dropout_111/cond/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_55", "inbound_nodes": [[["activation_164", 0, 0, {}], ["dropout_111", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_167", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_167", "inbound_nodes": [[["tf_op_layer_AddV2_55", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_7", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_7", "op": "StridedSlice", "input": ["activation_167/Relu", "strided_slice_7/begin", "strided_slice_7/end", "strided_slice_7/strides"], "attr": {"shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "5"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, "constants": {"1": [0, -1, 0], "2": [0, 0, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_strided_slice_7", "inbound_nodes": [[["activation_167", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_7", "inbound_nodes": [[["tf_op_layer_strided_slice_7", 0, 0, {}]]]}], "input_layers": [["input_8", 0, 0]], "output_layers": [["dense_7", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}