{"class_name": "Functional", "config": {"name": "functional_9", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 784, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_5"}, "name": "input_5", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "conv1d_60", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_60", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_56", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_56", "inbound_nodes": [[["conv1d_60", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_84", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_84", "inbound_nodes": [[["batch_normalization_56", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_56", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_56", "inbound_nodes": [[["activation_84", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_61", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_61", "inbound_nodes": [[["dropout_56", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_57", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_57", "inbound_nodes": [[["conv1d_61", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_85", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_85", "inbound_nodes": [[["batch_normalization_57", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_62", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_62", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_57", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_57", "inbound_nodes": [[["activation_85", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_28", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_28", "op": "AddV2", "input": ["conv1d_62/BiasAdd", "dropout_57/cond/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_28", "inbound_nodes": [[["conv1d_62", 0, 0, {}], ["dropout_57", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_86", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_86", "inbound_nodes": [[["tf_op_layer_AddV2_28", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_63", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [2], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_63", "inbound_nodes": [[["activation_86", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_58", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_58", "inbound_nodes": [[["conv1d_63", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_87", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_87", "inbound_nodes": [[["batch_normalization_58", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_58", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_58", "inbound_nodes": [[["activation_87", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_64", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [2], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_64", "inbound_nodes": [[["dropout_58", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_59", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_59", "inbound_nodes": [[["conv1d_64", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_88", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_88", "inbound_nodes": [[["batch_normalization_59", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_59", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_59", "inbound_nodes": [[["activation_88", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_29", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_29", "op": "AddV2", "input": ["activation_86/Relu", "dropout_59/cond/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_29", "inbound_nodes": [[["activation_86", 0, 0, {}], ["dropout_59", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_89", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_89", "inbound_nodes": [[["tf_op_layer_AddV2_29", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_65", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [4], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_65", "inbound_nodes": [[["activation_89", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_60", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_60", "inbound_nodes": [[["conv1d_65", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_90", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_90", "inbound_nodes": [[["batch_normalization_60", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_60", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_60", "inbound_nodes": [[["activation_90", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_66", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [4], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_66", "inbound_nodes": [[["dropout_60", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_61", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_61", "inbound_nodes": [[["conv1d_66", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_91", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_91", "inbound_nodes": [[["batch_normalization_61", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_61", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_61", "inbound_nodes": [[["activation_91", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_30", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_30", "op": "AddV2", "input": ["activation_89/Relu", "dropout_61/cond/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_30", "inbound_nodes": [[["activation_89", 0, 0, {}], ["dropout_61", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_92", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_92", "inbound_nodes": [[["tf_op_layer_AddV2_30", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_67", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [8], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_67", "inbound_nodes": [[["activation_92", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_62", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_62", "inbound_nodes": [[["conv1d_67", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_93", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_93", "inbound_nodes": [[["batch_normalization_62", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_62", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_62", "inbound_nodes": [[["activation_93", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_68", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [8], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_68", "inbound_nodes": [[["dropout_62", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_63", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_63", "inbound_nodes": [[["conv1d_68", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_94", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_94", "inbound_nodes": [[["batch_normalization_63", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_63", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_63", "inbound_nodes": [[["activation_94", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_31", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_31", "op": "AddV2", "input": ["activation_92/Relu", "dropout_63/cond/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_31", "inbound_nodes": [[["activation_92", 0, 0, {}], ["dropout_63", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_95", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_95", "inbound_nodes": [[["tf_op_layer_AddV2_31", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_69", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [16], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_69", "inbound_nodes": [[["activation_95", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_64", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_64", "inbound_nodes": [[["conv1d_69", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_96", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_96", "inbound_nodes": [[["batch_normalization_64", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_64", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_64", "inbound_nodes": [[["activation_96", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_70", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [16], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_70", "inbound_nodes": [[["dropout_64", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_65", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_65", "inbound_nodes": [[["conv1d_70", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_97", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_97", "inbound_nodes": [[["batch_normalization_65", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_65", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_65", "inbound_nodes": [[["activation_97", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_32", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_32", "op": "AddV2", "input": ["activation_95/Relu", "dropout_65/cond/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_32", "inbound_nodes": [[["activation_95", 0, 0, {}], ["dropout_65", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_98", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_98", "inbound_nodes": [[["tf_op_layer_AddV2_32", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_71", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [32], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_71", "inbound_nodes": [[["activation_98", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_66", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_66", "inbound_nodes": [[["conv1d_71", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_99", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_99", "inbound_nodes": [[["batch_normalization_66", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_66", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_66", "inbound_nodes": [[["activation_99", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_72", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [32], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_72", "inbound_nodes": [[["dropout_66", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_67", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_67", "inbound_nodes": [[["conv1d_72", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_100", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_100", "inbound_nodes": [[["batch_normalization_67", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_67", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_67", "inbound_nodes": [[["activation_100", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_33", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_33", "op": "AddV2", "input": ["activation_98/Relu", "dropout_67/cond/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_33", "inbound_nodes": [[["activation_98", 0, 0, {}], ["dropout_67", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_101", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_101", "inbound_nodes": [[["tf_op_layer_AddV2_33", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_73", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [64], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_73", "inbound_nodes": [[["activation_101", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_68", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_68", "inbound_nodes": [[["conv1d_73", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_102", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_102", "inbound_nodes": [[["batch_normalization_68", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_68", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_68", "inbound_nodes": [[["activation_102", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_74", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [64], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_74", "inbound_nodes": [[["dropout_68", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_69", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_69", "inbound_nodes": [[["conv1d_74", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_103", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_103", "inbound_nodes": [[["batch_normalization_69", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_69", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_69", "inbound_nodes": [[["activation_103", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_34", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_34", "op": "AddV2", "input": ["activation_101/Relu", "dropout_69/cond/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_34", "inbound_nodes": [[["activation_101", 0, 0, {}], ["dropout_69", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_104", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_104", "inbound_nodes": [[["tf_op_layer_AddV2_34", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_4", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_4", "op": "StridedSlice", "input": ["activation_104/Relu", "strided_slice_4/begin", "strided_slice_4/end", "strided_slice_4/strides"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "5"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "5"}}}, "constants": {"1": [0, -1, 0], "2": [0, 0, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_strided_slice_4", "inbound_nodes": [[["activation_104", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": 42}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["tf_op_layer_strided_slice_4", 0, 0, {}]]]}], "input_layers": [["input_5", 0, 0]], "output_layers": [["dense_4", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}